mkatherine/ENTS-node-firmware-cluster/stm32/Src/status_led.c
#include "status_led.h"

#include "stm32_seq.h"
#include "stm32_timer.h"
#include "gpio.h"

const static fast_period = 100;  // ms
const static slow_period = 500;  // ms
                                 //
static UTIL_TIMER_Object_t StatusLedTimer;

/**
 * @brief Toggles the status LED state
 */
void StatusLedFlashToggle(void);

void StatusLedInit(void) {
  // set default state to off
  HAL_GPIO_WritePin(USER_LED_GPIO_Port, USER_LED_Pin, GPIO_PIN_RESET);

  // set pin to output
  GPIO_InitTypeDef GPIO_InitStruct = {0};
  GPIO_InstStruct.Pin = USER_LED_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(USER_LED_GPIO_Port, &GPIO_InitStruct);

  // create the timer for flashing
  UTIL_TIMER_Create(&StatusLedTimer, slow_period, UTIL_TIMER_PERIODIC,
                    StatusLedFlashToggle, NULL);
}

void StatusLedFlashToggle(void) {
  // toggle LED
  HAL_GPIO_TogglePin(USER_LED_GPIO_Port, USER_LED_Pin);
}

void StatusLedFlashSlow(void) {
  // set period
  UTIL_TIMER_SetPeriod(&StatusLedTimer, slow_period);
  // start timer
  UTIL_TIMER_Start(&StatusLedTimer);
}

void StatusLedFlashFast(void) {
  // set period
  UTIL_TIMER_SetPeriod(&StatusLedTimer, fast_period); 
  // start timer
  UTIL_TIMER_Start(&StatusLedTimer);
}

void StatusLedOff(void) {
  // stop timer
  UTIL_TIMER_Stop(&StatusLedTimer);
  // turn on LED  
  HAL_GPIO_WritePin(USER_LED_GPIO_Port, USER_LED_Pin, GPIO_PIN_RESET);
}

void StatusLedOn(void) {  
  // stop timer
  UTIL_TIMER_Stop(&StatusLedTimer);
  // turn on LED
  HAL_GPIO_WritePin(USER_LED_GPIO_Port, USER_LED_Pin, GPIO_PIN_SET);
}
